Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/utilities-omegat.tmx
Source language: en_us
Languages: pt_br

source: Java Files (*.java)
pt_br: Arquivos Java (*.java)

source: Text Files (*.txt)
pt_br: Arquivos texto (*.txt)

source: Rejecting attempt by machine {0} to open a file in the IDE.
pt_br: Rejeitando tentativa da máquina {0} de abrir um arquivo no IDE.

source: Opening {0} ...
pt_br: Abrindo {0} ...

source: File {0} cannot be opened; will tell the launcher it is closed immediately.
pt_br: Arquivo {0} não pode ser aberto; o lançador será avisado de que o arquivo será fechado imediatamente.

source: File {0} was saved, but the Open File server was not running.
pt_br: Arquivo {0} foi salvo, mas o servidor para abrir arquivo não estava em execução.

source: Manually halt the launcher process.
pt_br: Interromper manualmene o processo de lançamento.

source: &Open File...
pt_br: Abrir arquiv&o...

source: File "{0}" does not exist.
pt_br: O arquivo "{0}" não existe.

source: "{0}" is a directory.
pt_br: "{0}" é um diretório.

source: "{0}" is not a plain file.
pt_br: "{0}" não é um arquivo simples.

source: Cannot open "{0}" - UNC paths are not supported.
pt_br: Não é possível abrir "{0}" - caminhos UNC não são suportados.

source: Usage:
pt_br: Utilização:

source: /path/to/jdk/jre/bin/java -jar /path/to/openfile.jar file1.java file2.java ...
pt_br: /caminho/para/jdk/jre/bin/java -jar /caminho/para/openfile.jar arquivo1.java arquivo2.java ...

source: Options:
pt_br: Opções:

source: -host HOSTNAME_OR_IP Specify the hostname to connect to (default localhost).
pt_br: -host HOSTNAME_OR_IP Especifica o nome da máquina para conexão (padrão: localhost).

source: -port NUMBER Specify the UDP port to connect to (default 7318).
pt_br: -port NUMBER Especifica a porta UDP para conexão (padrão: 7318).

source: -canon Canonicalize file names to absolute name (default).
pt_br: -canon Normalizar nomes de arquivos para nome absoluto (padrão).

source: -nocanon Do not alter file names; useful with -host.
pt_br: -nocanon Não alterar nome de arquivos; útil com -host.

source: -nowait Return immediately (default).
pt_br: -nowait Retornar imediatamente (padrão).

source: -wait Wait for the file to be edited and saved before returning.
pt_br: -wait Aguardar o arquivo ser editado e salvo antes de retornar.

source: -line LINE_NUMBER Open next file at a specified line number (starting with 1).
pt_br: -line LINE_NUMBER Abrir o próximo arquivo em uma linha especificada (começa com 1).

source: -help Show this help.
pt_br: -help Exibe esta ajuda.

source: {0} does not exist, or is not a plain file.
pt_br: {0} não existe, ou não é um arquivo simples.

source: Could not open {0}, UNC paths are not supported
pt_br: Não foi possível abrir {0}, caminhos UNC não são suportados

source: Could not open file at a specific line.
pt_br: Não foi possível abrir o arquivo em uma linha específica.

source: Open File could not find {0} in {1} ; perhaps there was a non-directory path component?
pt_br: Abrir arquivo não encontrou {0} em {1} ; talvez não foi fornecido um componente que não seja uma caminho?

source: Open File could not find {0} in the {1} directory.
pt_br: Abrir Arquivo não encontrou {0} no diretório {1}.

source: No valid file has been selected.
pt_br: Não foi selecionado um arquivo válido.

source: Server and External Tool Settings
pt_br: Configurações de servidores e ferramentas externas

source: Opens specified file(s), possibly at given location
pt_br: Abre arquivos especificados, possivelmente no local indicado

source: --open file1[:line1]...
pt_br: --open arquivo1[:linha1]...

source: Missing arguments to --open
pt_br: Faltando argumentos para --open

source: Open Recent File
pt_br: Abrir arquivos recentes

source: Regular Expression
pt_br: Expressão regular

source: Search Results
pt_br: Resultados da pesquisa

source: Window displaying search results
pt_br: Janela que exibe resultados de pesquisa

source: List of found files
pt_br: Lista de arquivos encontrados

source: List of found files, optionally with occurences of a given string
pt_br: Lista de arquivos encontrados, opcionalmente com ocorrências de um texto informado

source: Horizontal scrollbar
pt_br: Barra de rolagem horizontal

source: Vertical scrollbar
pt_br: Barra de rolagem vertical

source: Show/hide context area
pt_br: Exibe/Oculta área de contexto

source: Toggles display of the matching string's context
pt_br: Alterna exibiação de textos correspondentes ao contexto

source: Go to the previous matching string
pt_br: Ir para o texto corresponente anterior

source: Go to the next matching string
pt_br: Ir para o próximo texto correspondente

source: &Use This Criterion for Search
pt_br: &Utilizar este critério para pesquisa

source: Stop Sear&ch
pt_br: Parar pes&quisa

source: Stops searching and displays files found so far
pt_br: Para a pesquisa e mostra os arquivos encontrados até o momento

source: &Replace
pt_br: Substitui&r

source: Performs replace of all matches selected with a checked check-box
pt_br: Executa substituição de todas correspondências selecionadas com uma caixa de marcação já marcada

source: Modify Crit&eria
pt_br: Modificar crit&ério

source: Displays a Find dialog which allows to modify the search criteria
pt_br: Exibe uma janela de busca que lhe permite modificar os critérios de pesquisa

source: Find
pt_br: Localizar

source: &Help
pt_br: &Ajuda

source: Show A&ll Details
pt_br: Exibir todos deta&lhes

source: Displays links to all found occurences of the pattern to the Output Window
pt_br: Exibe ligações para as ocorrências encontradas do padrão da janela de saída

source: Search Res&ults
pt_br: Res&ultados da pesquisa

source: Each tab contains different search criterion
pt_br: Cada tabulação contém diferentes critérios de pesquisa

source: Panel which shows all enabled search types for user allowing to select appropriate criteria for new search.
pt_br: Painel que exibe todos tipos de pesquisa habilitados para o usuário, permitindo selecionar o critério mais adequado para uma nova pesquisa.

source: Cannot start a new search because the previous replace task has not finished yet.
pt_br: Não pode iniciar uma nova pesquisa porque a tarefa de substituição anterior ainda não foi terminada.

source: File {0} has been deleted
pt_br: Arquivo {0} foi excluído

source: File {0} is a directory now
pt_br: Arquivo {0} é um diretório agora

source: File {0} has changed since the start of the search
pt_br: Arquivo {0} foi alterado após o início da pesquisa

source: File {0} is too big
pt_br: Arquivo {0} é muito grande

source: File {0} cannot be read
pt_br: Arquivo {0} não pode ser lido

source: Remove From Search
pt_br: Remover da pesquisa

source: No matching files were found.
pt_br: Nenhum arquivo encontrado

source: Found {0} matching file(s).
pt_br: Encontrado {0} arquivo(s).

source: Found {1} match(es) in {0} file(s).
pt_br: Encontrado {1} combinação(ões) em {0} arquivo(s).

source: Found {1} match(es) of "{2}" in {0} file(s).
pt_br: Encontrado {1} combinação(ões) de "{2}" em {0} arquivo(s).

source: To be replaced with "{3}".
pt_br: Será subistituído com "{3}".

source: Found {0} matching files so far.
pt_br: Encontrado {0} arquivos até o momento.

source: Search stopped to prevent the IDE from running out of memory.
pt_br: Pesquisa parada para prevenir a execução do IDE além da memória disponível.

source: Searching...
pt_br: Pesquisando...

source: Finishing the previous search...
pt_br: Terminando a pesquisa anterior...

source: Cleaning the previous results...
pt_br: Limpando os resultados anteriores...

source: Printing details of the previous results...
pt_br: Imprimindo detalhes dos resultados anteriores...

source: Search cancelled
pt_br: Pesquisa cancelada

source: Found {0} matching file(s) [searching...]
pt_br: Encontrado {0} arquivo(s) [pesquisando]...

source: Found {1} match(es) in {0} file(s) [searching...]
pt_br: Encontrado {1} combinação(ões) em {0} arquivo(s) [pesquisando]...

source: line {0}, column {1}
pt_br: linha {0}, coluna {1}

source: line {0}
pt_br: linha {0}

source: [{1} at line {2}, column {3}] {0}
pt_br: [{1} na linha {2}, coluna {3}] {0}

source: [{1} line {2}] {0}
pt_br: [{1} linha {2}] {0}

source: position {0}:{1}
pt_br: posição {0}:{1}

source: Replacing...
pt_br: Substituindo...

source: Replace over files completed
pt_br: Substituição de arquivos terminado

source: The following issues were found before replacing started:
pt_br: Os seguintes casos foram encontrados antes de iniciar a substituição:

source: The following issues were encountered while replacing:
pt_br: Os seguintes casos foram encontrados enquando substituia:

source: Some issues were found before the replace operation was started.
pt_br: Alguns casos foram encontrados antes que a operação de substituição fosse iniciada.

source: Rescan files?
pt_br: Reanalisar arquivos?

source: Cannot access file {0} - it is currently being accessed by another action.
pt_br: Não pode acessar o arquivo {0} - está sendo acessado por outra ação.

source: Rescan
pt_br: Reanalisar

source: removed
pt_br: removido

source: No file selected
pt_br: Nenhum arquivo selecionado

source: Multiple items selected
pt_br: Itens múltiplos selecionados

source: P&ath:
pt_br: C&aminho:

source: Show node in Explorer
pt_br: Exibir nó no Explorer

source: Go to Detail
pt_br: Ir para detalhe

source: &Show in Filesystems
pt_br: Exibir em &Sistema de arquivos

source: P&osition within the file:
pt_br: P&osição dentro do arquivo:

source: Dialog for searching by criteria
pt_br: Janela para pesquisa por critérios

source: Locates and highlights the file in Explorer.
pt_br: Localiza e realça o arquivo no Explorer.

source: Cannot display the corresponding node.
pt_br: Não foi possível exibir o nó correspondente.

source: &Close
pt_br: &Fechar

source: Find in Projects
pt_br: Localizar em projetos

source: Find in Files...
pt_br: Localizar em arquivos...

source: Find in Pro&jects...
pt_br: Localizar em pro&jetos...

source: Replace in Files...
pt_br: Substituir em arquivos...

source: Repla&ce in Projects...
pt_br: Substitu&ir em projetos...

source: Find in Files
pt_br: Localizar em arquivos

source: Replace in Files
pt_br: Substituir em arquivos

source: Replace in Projects
pt_br: Substituir em projetos

source: Basic Criteria
pt_br: Critério básico

source: &Selection
pt_br: &Seleção

source: {0} nodes
pt_br: {0} nós

source: Containing &Text:
pt_br: Contendo o &texto:

source: (* = any string, ?
pt_br: (* = qualquer texto, ?

source: = any character, = escape for * ?)
pt_br: = qualquer caractere, = escape por * ?)

source: R&eplace With:
pt_br: Substitui&r por:

source: &File Name Patterns:
pt_br: &Padrões de nome de arquivo:

source: (Example: *.java, FZP??.jsp)
pt_br: (Exemplo: *.java, FZP??.jsp)

source: (all files)
pt_br: (todos arquivos)

source: Text to replace found matches with
pt_br: Texto para substituir correspondências encontradas com

source: &Whole Words
pt_br: Palavras &inteiras

source: If checked, matches not having word boundaries on both ends will be ignored
pt_br: Se marcado, combinações que não tenham palavras limitadas em ambos finais serão ignoradas

source: C&ase Sensitive
pt_br: Distinção de M&aiús&cula/Minúscula

source: Whether the fulltext search should be case-sensitive
pt_br: Se o texto completo de pesquisa deve ser maiúscula ou minúscula

source: &Regular Expression
pt_br: Expressão &regular

source: If checked, the search pattern will be used as a regular expression
pt_br: Se marcdao, o padrão da pesquisa será utilizado como uma expressão regular

source: Options
pt_br: Opções

source: Scope
pt_br: Escopo

source: User Utilities
pt_br: Utilitários do usuário

source: Infrastructure
pt_br: Infra-estrutura

source: Support for file searching, bookmarks.
pt_br: Suporte a pesquisa de arquivos, marcadores.

source: The User Utilities module provides miscellaneous pieces of functionality such as support for URLs (bookmarks), and file searching.
pt_br: O Módulo de utilitários do usuário fornece diversas peças funcionais como o suporte a URLs (marcadores), e pesquisa de arquivos.

source: It also provides the open file feature, which helps you open a file in a previously unmounted filesystem.
pt_br: Também é fornecida a funcionalidade de abrir arquivo, que ajuda a abrir um arquivo num sistema de arquivos ainda não-montado.

source: URL Objects
pt_br: Objetos de URL

source: This URL object does not contain a valid URL
pt_br: Este objeto de URL não contém uma URL válida

source: "{0}" is not a valid URL
pt_br: "{0}" não é uma URL válida

source: Open In New Window
pt_br: Abrir em nova janela

source: An error occurred during creation of the default bookmarks
pt_br: Ocorreu um erro ao criar marcadores padrões

source: Bookmarks
pt_br: Marcadores

source: Stores user Web bookmarks.
pt_br: Armazena marcadores Web do usuário.

source: &Bookmarks
pt_br: &Marcadores

source: Empty
pt_br: Vazio

source: Folder
pt_br: Diretório

source: New Folder
pt_br: Nova pasta

source: New Folder:
pt_br: Novo diretório:

source: Folder with name "{0}" already exists.
pt_br: Diretório com nome "{0}" já existe.

source: Bookmark
pt_br: Marcador

source: Bookmark Name:
pt_br: Nome do marcador:

source: New Bookmark Name
pt_br: Novo nome do marcador

source: Bookmark URL:
pt_br: URL do marcador:

source: New Bookmark URL
pt_br: Nova URL de marcador

source: Edit URL
pt_br: Editar URL

source: Separator
pt_br: Separador

source: Web Bookmark
pt_br: Marcador Web

source: Online &Docs and Support
pt_br: &Documentação e suporte online

source: Home on the Web
pt_br: Home na Web

source: &Keyboard Shortcuts Card
pt_br: Cartão de &atalhos de teclado

source: URL that the bookmark points to.
pt_br: URL apontada pelo marcador.

source: Name
pt_br: Nome

source: Name of this object.
pt_br: Nome deste objeto.

source: Set Bookmark URL
pt_br: Definir URL do marcador

source: {0} of {1}
pt_br: {0} de {1}

source: PDF Document Objects
pt_br: Objetos de documentos PDF

source: PDF Viewer Not Found ...
pt_br: Visualizador de PDF não encontrado...

source: Select
pt_br: Selecionar

source: The IDE needs a PDF viewer application, such as Acrobat Reader.
pt_br: O IDE precisa de uma aplicação de visualização de PDF, como o Acrobat Reader.

source: Please select an executable program to view PDF files with.
pt_br: Selecione um programa para visualizar arquivos PDF.

source: Details of the problem: {0}: {1}
pt_br: Detalhes do problema: {0}: {1}

source: Current viewer:
pt_br: Visualizador atual:

source: &Select ...
pt_br: &Selecionar...

source: Error while parsing file {0}.
pt_br: Erro analisando o arquivo {0}.

source: It does not have the expected structure (DTD).
pt_br: O arquivo não tem a estrutura esperada (DTD).

source: File "{0}" does not exist or is not a plain file.
pt_br: O arquivo "{0}" não existe ou não é um arquivo simples.

source: Cannot open "{1}" specified in "{0}" - malformed URL.
pt_br: Não é possível abrir "{1}" especificado em "{0}" - URL mal-formada.

source: Cannot open "{1}" specified in "{0}" - only URLs having protocol "file" are supported.
pt_br: Não é possível abrir "{1}" especificado em "{0}" - apenas URLs com protocolo "file" são suportadas.

source: Jump To
pt_br: Saltar para

source: Editing
pt_br: Edição

source: An action to quicky navigate to a file or a type
pt_br: Uma ação de navegação rápida para um arquivo ou um tipo

source: This module provides actions which allows to navigate to a file in an open project by entering its name, or a type by entering its type name or a regular expression or CamelCase name.
pt_br: Este módulo fornece ações que permitem navegar por arquivos em um projeto aberto informando seu nome, ou um tipo informando seu nome de tipo ou uma expressão regular ou nome CamelCase.

source: Go to File...
pt_br: Ir para arquivo...

source: File...
pt_br: Arquivo...

source: &Select in Projects
pt_br: &Seleciar em projetos

source: Go to File
pt_br: Ir para arquivo

source: File &Name (prefix, wildcards: "?" "*"):
pt_br: &Nome de arquivo (prefixo, curingas: "?" "*"):

source: &Matching Files
pt_br: Co&mbinando arquivos

source: &Case Sensitive
pt_br: Distinção de Maiús&cula/Minúscula

source: Location:
pt_br: Local:

source: <No Files Found>
pt_br: <Nenhum arquivo encontrado>

source: Searching Other Projects...
pt_br: Pesquisando outros projetos...

source: Show &Hidden Files
pt_br: Exibir arquivos &ocultos

source: &Prefer Current Project
pt_br: &Preferir projeto atual

source: Prefer Current Project ({0})
pt_br: Preferir projeto atual ({0})

source: Location
pt_br: Local

source: Case Sensitive
pt_br: Distinção de Maiúscula/Minúscula

source: Prefer Current Project
pt_br: Preferir projeto atual

source: Show Hidden Files
pt_br: Exibir arquivos ocultos

source: Matching Files
pt_br: Combinando arquivos

source: Search text
pt_br: Texto procurado

source: Go To File
pt_br: Ir para arquivo

source: Go To Type
pt_br: Ir para tipo

source: Open Type allows you to jump to type declarations in other files
pt_br: Abrir tipo, lhe permite saltar para as declarações de tipos em outros arquivos

source: Open
pt_br: Abrir

source: Usages of {0}
pt_br: Utilização de {0}

source: Go to &File...
pt_br: Ir para &arquivo...

source: Go to &Type...
pt_br: Ir para &tipo...

source: Type...
pt_br: Tipo...

source: Go to Type
pt_br: Ir para tipo

source: Browse Type Dialog
pt_br: Janela de navegação de tipo

source: Opens Dialog, which permits for quick browsing of Types
pt_br: Abrir a janela, a qual lhe permite navegar rapidamente pelos tipos

source: <No Types Found>
pt_br: <Nenhum tipo encontrado>

source: Type &Name (prefix, camel case: "AA" or "AbcAb", wildcards: "?" "*", exact match: end with space) :
pt_br: &Nome do tipo (prefixo, camel case: "AA" ou "AbcAb", curingas: "?" "*", combinação exata: termina com espaço) :

source: Types Found :
pt_br: Tipos encontrados :

source: Case &Sensitive
pt_br: Di&stinção de Maiúscula/Minúscula

source: Unit Tests
pt_br: Testes unitários

source: Go to Test
pt_br: Ir para o teste

source: Go to Tested Class
pt_br: Ir para classes testadas

source: Jumps to the corresponding test class or source class
pt_br: Salta para a classe ou fonte de teste correspondente

source: Test
pt_br: Testar

source: Navigate To Test
pt_br: Navegar para o teste

source: Testing Tools
pt_br: Ferramentas de teste

source: An action to quicky navigate to a the test for a file, or the file for a test
pt_br: Uma ação de navegação rápida para um teste de um arquivo, ou um arquivo de teste

source: Projects Searching
pt_br: Pesquisa em Projetos

source: Support for searching projects for files.
pt_br: Suporte à pesquisa de arquivos em projetos.

source: The module provides functionality for searching projects for files.
pt_br: O módulo fornece funcionalidades para a pesquisa de arquivos dentro de projetos.

source: Find/Replace &in Projects...
pt_br: Pesqu&isar/Substituir em Projetos...

source: Find/Replace in Projects
pt_br: Pesquisar/Substituir em Projetos

source: &Open Projects
pt_br: Pr&ojetos abertos

source: &Main Project
pt_br: Projeto pri&ncipal
